tutorials/compressiblePbeTransportFoam/twentyThreeDegreeWedge/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 1e-3;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 1e-3;
    }

    outlet
    {
        type            calculated;
        value           uniform 1e-3;
    }

    bottom
    {
        type            symmetryPlane;
    }

    top
    {
        type            symmetryPlane;
    }

    obstacle
    {
        type            compressible::alphatWallFunction;
        value           uniform 1e-3;
    }

    defaultFaces
    {
        type            empty;
    }

}


// ************************************************************************* //
